Courses/7370/Lectures/Semaphores/semaphores.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Semaphores</title>
<!-- 2016-09-05 Mon 11:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="WSU CEG 7370 Distributed Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2016-09-06 | <a href="../../">../../</a>
</div>
<div id="content">
<h1 class="title">Semaphores</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Semapahores</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Def: An ADT, with P, V operations on integers, and atomicity and await
</li>
<li><a href="./semaphoreSemantics.html">./semaphoreSemantics.html</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Split Binary Semaphores</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Def</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Consider a binary semaphore b.
</li>
<li>Imagine "splitting" it into multiple binary semaphores such that
<ol class="org-ol">
<li>sum-of b = {b<sub>1</sub> + b<sub>2</sub> + &#x2026; + b<sub>n</sub>}, at all times
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Uses</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Starvation-Free Mutex
</li>
<li>Passing the Baton Technique (cf. Readers-Writers)
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Starvation-Free Mutex Semaphore</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>The std solution  is not starvation-free.
</li>
<li>Fairness: "Weak v Strong" semaphores.
</li>
<li><a href="./split-binary-semaphores.html">./split-binary-semaphores.html</a>
</li>
<li><a href="./udding-morris-algs.html">./udding-morris-algs.html</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Distributed Semaphores</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Implement semaphores in the distributed context: strictly peer-to-peer
</li>
<li>Where is "the" "queue" of processes waiting to finish P(m) located?
</li>
<li>Andrews Algorithm: <a href="./semaphore-distributed.html">./semaphore-distributed.html</a>
</li>
<li>Many "better" algorithms now exist.
</li>
<li>Most distributed implementations are "suspect".
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> The Power of semaphores</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Semaphore Ops: P and V.
</li>
<li>Will we improve the "power" of Semaphores with additional ops?
</li>
</ol>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Add Peek and Pp?</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>peek(s) defined as "return &lt;s &gt; 0&gt;"
</li>

<li>Pp(s) defined as
<div class="org-src-container">

<pre class="src src-bash">function Pp(s): boolean
  if &lt;s &gt; 0&gt; -&gt; &lt;s := s - 1&gt;; return True
  [] &lt;s &lt; 0&gt; -&gt; return False
  fi
end
</pre>
</div>
</li>

<li>Would either of the two ops add "power" to the semaphore?
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Cigarette Smokers Problem</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>What problems of concurrency can semaphores solve?
</li>
<li>Introduces an array of semaphores.
</li>
<li>Cigarette Smokers Problem cannot be solved without arrays.
</li>
<li><a href="https://en.wikipedia.org/wiki/Cigarette_smokers_problem">Cigarette Smokers Problem</a>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Allen B. Downey, The Little Book of Semaphores, book, 290+
pp, 2016.  Free pdf, <a href="http://greenteapress.com/wp/semaphores/">http://greenteapress.com/wp/semaphores/</a>.
</li>
</ol>


<ol class="org-ol">
<li>Leslie Lamport, title = {The Mutual Exclusion Problem - Part I: A
Theory of Interprocess Communication}, year = {2000}
<a href="http://research.microsoft.com/users/lamport/pubs/mutual1.pdf">http://research.microsoft.com/users/lamport/pubs/mutual1.pdf</a>
</li>

<li>author = {L. Lamport}, title = {The Mutual Exclusion Problem - Part
II: Statement and Solutions}, year = {2000}
<a href="http://research.microsoft.com/users/lamport/pubs/mutual2.pdf">http://research.microsoft.com/users/lamport/pubs/mutual2.pdf</a>
</li>
</ol>


<ol class="org-ol">
<li>Vlad Popov and Oleg Mazonka, Faster Fair Solution for the
Reader-Writer Problem, 2013.  <a href="http://arxiv.org/pdf/1309.4507.pdf">http://arxiv.org/pdf/1309.4507.pdf</a>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> End</h2>
<div class="outline-text-2" id="text-7">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2016-09-06
</div>
</body>
</html>
